chipKIT32/chipKIT-core/pic32/cores/pic32/wiring_analog.c
#elif defined(__PIC32MZEFADC__)
    #error EF ADC code not implemented yet

#else
    #error ADC code for this MZ must be added in WSystems.c and wiring_analog.c
#endif

#else
	AD1CHS = (channelNumber & 0xFFFF) << 16;
	AD1CON1	=	0; //Ends sampling, and starts converting

	/* Set up for manual sampling
	*/
	AD1CSSL	=	0;
	AD1CON3	=	0x000B;	//Tad = internal 22 Tpb
	AD1CON2	=	analog_reference;

	/* Turn on ADC
	*/
	AD1CON1SET	=	0x8000;
	
	/* Start sampling
	*/
	AD1CON1SET	=	0x0002;
	
	/* Delay for a bit
	*/
	delayMicroseconds(2);

	/* Start conversion
	*/
	AD1CON1CLR	=	0x0002;
	
	/* Wait for conversion to finish
	*/
	while (!(AD1CON1 & 0x0001));
	

	/* Read the ADC Value
	*/
	analogValue	=	ADC1BUF0;
#endif
	
	return (analogValue);
}

//*********************************************************************
//* These _analogRead functions are an attempt to speed up the
//* analogRead funtions of the chipKIT-core by allowing for non-
//* blocking calls to _analogReadConversionComplete() from our loop()
//* while at the same time not breaking existing analogRead functionality.
//* When all rung out the _analogRead() should be renamed to analogRead()
//* and the currently existing function should be removed.
//* -J. Christ Oct 2016
//*********************************************************************
uint8_t	_analogRead_channelNumber; // breaking up analogRead required making a shared global 

uint8_t _analogReadConversionStart(uint8_t pin){
  uint8_t ain;

	/* Check if pin number is in valid range.
	*/
	if (pin >= NUM_DIGITAL_PINS_EXTENDED)
	{
		return 0;
	}

#if (OPT_BOARD_ANALOG_READ != 0)
	/* Peform any board specific processing.
	*/
int _board_analogRead(uint8_t pin, int * val);
int	tmp;

	if (_board_analogRead(pin, &tmp) != 0)
	{
		return tmp;
	}
#endif		// OPT_BOARD_ANALOG_READ

	/* Pin number is allowed to be either the digital pin number or the
	** analog pin number. Map the input so that it is guaranteed to be
	** an analog pin number.
	*/
	ain = (pin < NUM_DIGITAL_PINS) ? digitalPinToAnalog(pin) : NOT_ANALOG_PIN;
	if (ain == NOT_ANALOG_PIN) {
		return 0;
	}

	/* Map the analog pin number to the correct analog mux channel in the
	** A/D converter. In some cases this is a direct mapping. In that case,
	** the conversion macro just returns it parameter.
	*/
	_analogRead_channelNumber = analogInPinToChannel(ain);

	/* Ensure that the pin associated with the analog channel is in analog
	** input mode, and select the channel in the input mux.
	*/
#if defined(__PIC32_PPS__)
	p32_ioport *	iop;
	uint16_t		bit;

    // here is a nasty bug. In Arduino, the pin number passed in can be a digital pin
    // or it can be an analog pin; we don't know what was passed in.
    // so check to see if an analog pin was passed in, and if it was
    // we have to manually find the actual digital pin so we can set the PIC registers.

    // if this doesn't map, than the analog pin was passed in.
    if( ain != digital_pin_to_analog_PGM[pin])
    {
        int i = 0;

        // painstakingly find the digital pin
        for(i=0; i<NUM_DIGITAL_PINS; i++)
        {
            // we found the pin
            if(ain == digital_pin_to_analog_PGM[i])
            {
                pin = i;
                break;
            }
        }

        // did not find it
        if(i == NUM_DIGITAL_PINS)
        {
            return(0);
        }
    }

	/* In MX1/MX2/MZXX devices, there is a control register ANSEL associated with
	**  each io port. We need to set the appropriate bit in the ANSEL register
	**  for the io port associated with this pin to ensure that it is in analog
	**  input mode.
	**
	** Obtain pointer to the registers for this io port.
	*/
	iop = portRegisters(digitalPinToPort(pin));             // THIS is way we needed to know the ACTUAL digital pin number.

	/* Obtain bit mask for the specific bit for this pin.
	*/
	bit = digitalPinToBitMask(pin);                         // THIS is way we needed to know the ACTUAL digital pin number.

	/* Set the bit in the ANSELx register to ensure that the pin is in
	** analog input mode.
	*/
	iop->ansel.set = bit;
#else
	/* In the other PIC32 devices, all of the analog input capable pins are
	**  in PORTB, and the AD1PCFG register is used to set the pins associated
	**  with PORTB to analog input or digital input mode. Clear the appropriate
	**  bit in AD1PCFG.
	*/
	AD1PCFGCLR = (1 << _analogRead_channelNumber);
#endif		// defined(__PIC32_PPS__)

#if defined(__PIC32MZXX__)

// If alternate ADC implementation
#if defined(__ALT_ADC_IMPL__)
    // As of this writing only WiFire and OpenScope use this feature.
    // for now, return true and let _analogReadConversion be blocking for these chips
    return true;

// EC MZ ADC code
#elif defined(__PIC32MZECADC__)
    // for now, return true and let _analogReadConversion be blocking for these chips
    return true;

#elif defined(__PIC32MZEFADC__)
    #error EF ADC code not implemented yet

#else
    #error ADC code for this MZ must be added in WSystems.c and wiring_analog.c
#endif

#else
	AD1CHS = (_analogRead_channelNumber & 0xFFFF) << 16;
	AD1CON1	=	0; //Ends sampling, and starts converting

	/* Set up for manual sampling
	*/
	AD1CSSL	=	0;
	AD1CON3	=	0x000B;	//Tad = internal 22 Tpb
	AD1CON2	=	analog_reference;

	/* Turn on ADC
	*/
	AD1CON1SET	=	0x8000;
	
	/* Start sampling
	*/
	AD1CON1SET	=	0x0002;
	
	/* Delay for a bit
	*/
	delayMicroseconds(2);

	/* Start conversion
	*/
	AD1CON1CLR	=	0x0002;
	
#endif

  return true; // assume everthing worked until we have time to write better code.
}

inline uint8_t _analogReadConversionComplete(){

#if defined(__PIC32MZXX__)

// If alternate ADC implementation
#if defined(__ALT_ADC_IMPL__)
    // As of this writing only WiFire and OpenScope use this feature.
    // for now, return true and let _analogReadConversion be blocking for these chips
    return true;

// EC MZ ADC code
#elif defined(__PIC32MZECADC__)
    // for now, return true and let _analogReadConversion be blocking for these chips
    return true;

